olliw42/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-g4.c
//*******************************************************
// STM32 DroneCAN Library
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// DroneCAN Driver Library for STM32 using HAL
// for use with libcanard
//*******************************************************
#if defined STM32G431xx ||defined STM32G441xx || defined STM32G491xx || defined STM32G474xx

#include "stm32g4xx_hal.h"

#ifdef HAL_FDCAN_MODULE_ENABLED
#include "stm32-dronecan-driver.h"
#include <string.h>


#define DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX  8 // must be equal to SRAMCAN_FLE_NBR, for FDCAN_EXTENDED_ID

// we can use IS_FDCAN_NOMINAL_PRESCALER(), IS_FDCAN_NOMINAL_TSEG1(), IS_FDCAN_NOMINAL_TSEG2(), IS_FDCAN_NOMINAL_SJW() !
#define DC_HAL_PRESCALER_MIN        1
#define DC_HAL_PRESCALER_MAX        512

#define DC_HAL_NOMINAL_BS1_MIN      1     // datasheet: bit_time must be 4 .. 81 tq
#define DC_HAL_NOMINAL_BS1_MAX      256
#define DC_HAL_NOMINAL_BS2_MIN      1
#define DC_HAL_NOMINAL_BS2_MAX      128
#define DC_HAL_NOMINAL_SJW_MIN      1
#define DC_HAL_NOMINAL_SJW_MAX      128

#define DC_HAL_DATA_PRESCALER_MIN   1
#define DC_HAL_DATA_PRESCALER_MAX   32
#define DC_HAL_DATA_BS1_MIN         1
#define DC_HAL_DATA_BS1_MAX         32
#define DC_HAL_DATA_BS2_MIN         1
#define DC_HAL_DATA_BS2_MAX         16
#define DC_HAL_DATA_SJW_MIN         1
#define DC_HAL_DATA_SJW_MAX         16    // datasheet: must always be smaller than BS2


static tDcHalStatistics dc_hal_stats = {};

static uint8_t abort_tx_on_error;

static FDCAN_HandleTypeDef hfdcan;

static uint32_t tx_tlast_ms = 0; // for TX timeout error counting in dc_hal_transmit()
static uint8_t was_bo = 0; // for counting bus off errors only when state changes

static uint8_t fd_mode_enabled; // set when the iface was opened with data_timings != NULL
static uint8_t fd_frame_detected; // set once a FD frame has been seen


//-------------------------------------------------------
// Helper
//-------------------------------------------------------

static void _process_error_status(void)
{
//    FDCAN_ProtocolStatusTypeDef protocolStatus;
//    HAL_FDCAN_GetProtocolStatus(&hfdcan, &protocolStatus);
//    if (protocolStatus.BusOff) {
//        CLEAR_BIT(hfdcan.Instance->CCCR, FDCAN_CCCR_INIT);
//    }
    uint32_t psr = READ_REG(hfdcan.Instance->PSR); // read the protocol status register

    if ((psr & FDCAN_PSR_BO) != 0) { // is bus off
        CLEAR_BIT(hfdcan.Instance->CCCR, FDCAN_CCCR_INIT);
        HAL_FDCAN_AbortTxRequest(&hfdcan, FDCAN_TX_BUFFER0 | FDCAN_TX_BUFFER1 | FDCAN_TX_BUFFER2);
        if (!was_bo) dc_hal_stats.bo_count++; // BO, bus off, only count when toggled from bus on to bus off
        was_bo = 1;
    } else {
        was_bo = 0;
    }

    uint32_t lec = (psr & FDCAN_PSR_LEC) >> FDCAN_PSR_LEC_Pos; // Last Error Code
    uint32_t dlec = (psr & FDCAN_PSR_DLEC) >> FDCAN_PSR_DLEC_Pos; // Data Last Error Code
    if ((lec != FDCAN_PROTOCOL_ERROR_NONE && lec != FDCAN_PROTOCOL_ERROR_NO_CHANGE) ||
        (dlec != FDCAN_PROTOCOL_ERROR_NONE && dlec != FDCAN_PROTOCOL_ERROR_NO_CHANGE)) {
        CLEAR_BIT(hfdcan.Instance->PSR, FDCAN_PSR_LEC | FDCAN_PSR_DLEC);
        if (abort_tx_on_error) {
            HAL_FDCAN_AbortTxRequest(&hfdcan, FDCAN_TX_BUFFER0 | FDCAN_TX_BUFFER1 | FDCAN_TX_BUFFER2);
        }
        if (lec != FDCAN_PROTOCOL_ERROR_NONE && lec != FDCAN_PROTOCOL_ERROR_NO_CHANGE) {
            dc_hal_stats.lec_count++; // LEC, Last Error Code
            if (lec == FDCAN_PROTOCOL_ERROR_ACK) dc_hal_stats.lec_ack_count++;
        }
        // CAN FD diagnostics
        if (dlec != FDCAN_PROTOCOL_ERROR_NONE && dlec != FDCAN_PROTOCOL_ERROR_NO_CHANGE) {
            dc_hal_stats.dlec_count++; // DLEC, Data-phase Last Error Code
            switch (dlec) {
                case FDCAN_PROTOCOL_ERROR_STUFF: dc_hal_stats.dlec_stuff_count++; break;
                case FDCAN_PROTOCOL_ERROR_FORM: dc_hal_stats.dlec_form_count++; break;
                case FDCAN_PROTOCOL_ERROR_ACK: dc_hal_stats.dlec_ack_count++; break;
                case FDCAN_PROTOCOL_ERROR_BIT1: dc_hal_stats.dlec_bit1_count++; break;
                case FDCAN_PROTOCOL_ERROR_BIT0: dc_hal_stats.dlec_bit0_count++; break;
                case FDCAN_PROTOCOL_ERROR_CRC: dc_hal_stats.dlec_crc_count++; break;
            }
        }
    }

    if ((psr & FDCAN_PSR_PXE) != 0) { // protocol exception event occurred, happens when fc is not yet doing CAN
        CLEAR_BIT(hfdcan.Instance->PSR, FDCAN_PSR_PXE);
        dc_hal_stats.pxe_count++; // PXE, Protocol Exception Event
    }

    uint32_t ecr = READ_REG(hfdcan.Instance->ECR); // read the error counter register, read clears CEL
    dc_hal_stats.tec_count = (ecr & FDCAN_ECR_TEC) >> FDCAN_ECR_TEC_Pos; // TEC, Transmit Error Counter
    dc_hal_stats.rec_count = (ecr & FDCAN_ECR_REC) >> FDCAN_ECR_REC_Pos; // REC, Receive Error Counter
    if ((ecr & FDCAN_ECR_CEL) != 0) { // Can Error Logging
        dc_hal_stats.cel_count += (ecr & FDCAN_ECR_CEL) >> FDCAN_ECR_CEL_Pos; // CEL, Can Error Logging
    }

    // record some more
    if (lec != FDCAN_PROTOCOL_ERROR_NO_CHANGE) dc_hal_stats.last_lec = lec;
    dc_hal_stats.last_psr = psr;
    dc_hal_stats.last_ecr = ecr;
    dc_hal_stats.last_cccr = READ_REG(hfdcan.Instance->CCCR);
    // CAN FD
    if (dlec != FDCAN_PROTOCOL_ERROR_NO_CHANGE) dc_hal_stats.last_dlec = dlec;
}


// convert DLC field to data length in bytes (with CAN FD encoding)
static const uint8_t dlc_to_len[16] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 12, 16, 20, 24, 32, 48, 64};

uint8_t _data_len_from_dlc(uint8_t dlc)
{
    return (dlc < 16) ? dlc_to_len[dlc] : 64;
}


// convert data length in bytes to DLC field (with CAN FD encoding)
uint8_t _dlc_from_data_len(uint8_t data_len)
{
    if (data_len > 64) data_len = 64; // should not happen, but play it safe
    if (data_len <= 8) return data_len;
    if (data_len <= 12) return 9;
    if (data_len <= 16) return 10;
    if (data_len <= 20) return 11;
    if (data_len <= 24) return 12;
    if (data_len <= 32) return 13;
    if (data_len <= 48) return 14;
    return 15; // 49-64 bytes
}


//-------------------------------------------------------
// Init
//-------------------------------------------------------

int16_t dc_hal_init(
    DC_HAL_CAN_ENUM can_instance,
    const tDcHalCanTimings* const timings,
    const tDcHalCanDataTimings* const data_timings,
    const DC_HAL_IFACE_MODE_ENUM iface_mode)
{
    if ((iface_mode != DC_HAL_IFACE_MODE_NORMAL) &&
        (iface_mode != DC_HAL_IFACE_MODE_SILENT) &&
        (iface_mode != DC_HAL_IFACE_MODE_AUTOMATIC_TX_ABORT_ON_ERROR)) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

