olliw42/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-g4.c
    tx_tlast_ms = tnow_ms;
    dc_hal_stats.transmitted_frame_count++;

    return 1;
}


//-------------------------------------------------------
// Receive
//-------------------------------------------------------
#ifndef DRONECAN_USE_RX_ISR
//-- Polling
#error CAN polling not supported, DRONECAN_USE_RX_ISR must be defined !
#else
//-- ISR

#define DC_FDCAN_RX_FIFO_ELEMENT_SIZE  (18U * 4U) // Rx FIFO 0/1 element size in bytes, 2 words + 64 bytes = 18*4


typedef struct
{
    uint32_t r0;
    uint32_t r1;
    union {
        uint8_t data[CANARD_CANFD_FRAME_MAX_DATA_LEN];
        uint32_t data_32[CANARD_CANFD_FRAME_MAX_DATA_LEN / 4]; // CANARD_CANFD_FRAME_MAX_DATA_LEN should be divisible by 4
    };
} tDcRxFifoElement;


typedef enum // see table 400 in datasheet
{
    DC_RX_FIFO_R0_XTD_BIT   = 0x40000000U, // extended identifier
    DC_RX_FIFO_R0_RTR_BIT   = 0x20000000U, // remote transmission request
    DC_RX_FIFO_R1_FDF_BIT   = 0x00200000U, // FD format
    DC_RX_FIFO_R1_BRS_BIT   = 0x00100000U, // bit rate switch
    DC_RX_FIFO_R1_DLC_MASK  = 0x000F0000U, // data length code, equals FDCAN_DLC_BYTES_64
} DC_RX_FIFO_ELEMENT_ENUM;


#define DRONECAN_RXFRAMEBUFSIZEMASK  (DRONECAN_RXFRAMEBUFSIZE - 1)


volatile tDcRxFifoElement dronecan_rxbuf[DRONECAN_RXFRAMEBUFSIZE];
volatile uint16_t dronecan_rxwritepos; // pos at which the last frame was stored
volatile uint16_t dronecan_rxreadpos; // pos at which the next frame is to be fetched


void _dc_hal_receive_isr(uint32_t* RxAddress)
{
    uint32_t r0 = *RxAddress;
    if ((r0 & DC_RX_FIFO_R0_XTD_BIT) == 0) { // DroneCAN uses only EXT frames, so this should be an error
        dc_hal_stats.isr_xtd_count++;
        return;
    }
    if ((r0 & DC_RX_FIFO_R0_RTR_BIT) != 0) { // DroneCAN does not use RTR frames, so this should be an error
        dc_hal_stats.isr_rtr_count++;
        return;
    }

    RxAddress++;
    uint32_t r1 = *RxAddress;
    bool is_fd_frame = ((r1 & DC_RX_FIFO_R1_FDF_BIT) != 0);
    if (!fd_mode_enabled) {
        if (is_fd_frame) {
            dc_hal_stats.isr_fdf_count++;
            return;
        }
        if ((r1 & DC_RX_FIFO_R1_BRS_BIT) != 0) {
            dc_hal_stats.isr_brs_count++;
            return;
        }
    } else {
        if (is_fd_frame) fd_frame_detected = 1; // report that one FD frame has been seen
    }

    // for classic CAN, reject frames with DLC > 8
    if (!is_fd_frame && ((r1 & DC_RX_FIFO_R1_DLC_MASK) > FDCAN_DLC_BYTES_8)) {
        dc_hal_stats.isr_dlc_count++;
        return;
    }

    uint16_t next = (dronecan_rxwritepos + 1) & DRONECAN_RXFRAMEBUFSIZEMASK;
    if (dronecan_rxreadpos != next) { // fifo not full
        dronecan_rxwritepos = next;

        dronecan_rxbuf[next].r0 = r0;
        dronecan_rxbuf[next].r1 = r1;
        RxAddress++;
        // copy all data bytes based on actual DLC (G4 message RAM supports 64 bytes)
        uint32_t dlc = (r1 & DC_RX_FIFO_R1_DLC_MASK) >> 16;
        uint8_t data_len = _data_len_from_dlc(dlc);
        uint8_t word_len = (data_len + 3) / 4; // round up to full words
        for (uint8_t i = 0; i < word_len; i++) {
            dronecan_rxbuf[next].data_32[i] = *RxAddress;
            RxAddress++;
        }

        // fill can reach DRONECAN_RXFRAMEBUFSIZE - 1 at most, one slot is always kept free
        uint16_t fill = (next - dronecan_rxreadpos) & DRONECAN_RXFRAMEBUFSIZEMASK;
        if (fill > dc_hal_stats.rx_fifo_peak) dc_hal_stats.rx_fifo_peak = fill;

    } else {
        dc_hal_stats.rx_overflow_count++; // rx frame buffer overflow
        dc_hal_stats.rx_fifo_peak = DRONECAN_RXFRAMEBUFSIZE; // full
    }
}


void _dc_hal_isr_handler(void)
{
    //HAL_FDCAN_IRQHandler(&hfdcan);
    // copy the part relevant to us
    // flags:
    //   FDCAN_IR_RF0L           // Rx FIFO 0 message lost
    //   FDCAN_IR_RF0F           // Rx FIFO 0 full
    //   FDCAN_IR_RF0N           // New message written to Rx FIFO 0
    // more descriptive defines are in the HAL, like FDCAN_FLAG_RX_FIFO0_NEW_MESSAGE
    // #define FDCAN_RX_FIFO0_MASK (FDCAN_IR_RF0L | FDCAN_IR_RF0F | FDCAN_IR_RF0N)
    // there are also analogous defines
    //   FDCAN_IE_RF0LE          // Rx FIFO 0 message lost
    //   FDCAN_IE_RF0FE          // Rx FIFO 0 full
    //   FDCAN_IE_RF0NE          // New message written to Rx FIFO 0
    // for which there are also more descriptive defines in the HAL, like FDCAN_IT_RX_FIFO0_NEW_MESSAGE

    uint32_t RxFifo0ITs = hfdcan.Instance->IR & (FDCAN_IR_RF0N | FDCAN_IR_RF0F | FDCAN_IR_RF0L); // __HAL_FDCAN_GET_FLAG()
    RxFifo0ITs &= hfdcan.Instance->IE; // __HAL_FDCAN_GET_IT_SOURCE()
    uint32_t RxFifo1ITs = hfdcan.Instance->IR & (FDCAN_IR_RF1N | FDCAN_IR_RF1F | FDCAN_IR_RF1L);
    RxFifo1ITs &= hfdcan.Instance->IE;

    if (RxFifo0ITs != 0) {
        __HAL_FDCAN_CLEAR_FLAG(&hfdcan, RxFifo0ITs); // clear Rx FIFO0 flags

        if ((RxFifo0ITs & (FDCAN_IR_RF0N | FDCAN_IR_RF0F)) != 0) { // do it also if Rx FIFO 0 full
            // HAL_FDCAN_GetRxMessage()
            while ((hfdcan.Instance->RXF0S & FDCAN_RXF0S_F0FL) != 0) { // Rx FIFO 0 not empty
                // calculate Rx FIFO 0 element address
                uint32_t GetIndex = ((hfdcan.Instance->RXF0S & FDCAN_RXF0S_F0GI) >> FDCAN_RXF0S_F0GI_Pos);
                uint32_t* RxAddress = (uint32_t*)(hfdcan.msgRam.RxFIFO0SA + (GetIndex * DC_FDCAN_RX_FIFO_ELEMENT_SIZE));
                _dc_hal_receive_isr(RxAddress);
                // acknowledge the Rx FIFO 0 that the oldest element is read so that it increments the GetIndex
                hfdcan.Instance->RXF0A = GetIndex;
            }
        }

        if ((RxFifo0ITs & FDCAN_IR_RF0F) != 0) {
            dc_hal_stats.isr_rf0f_count++; // RF0F, Rx Fifo 0 Full
        }
        if ((RxFifo0ITs & FDCAN_IR_RF0L) != 0) {
            dc_hal_stats.isr_rf0l_count++; // RF0L, Rx Fifo 0 Message Lost
        }
    }

    if (RxFifo1ITs != 0) {
        __HAL_FDCAN_CLEAR_FLAG(&hfdcan, RxFifo1ITs); // clear Rx FIFO1 flags

        if ((RxFifo1ITs & (FDCAN_IR_RF1N | FDCAN_IR_RF1F)) != 0) { // do it also if Rx FIFO 1 full
            while ((hfdcan.Instance->RXF1S & FDCAN_RXF1S_F1FL) != 0) { // Rx FIFO 1 not empty
                // calculate Rx FIFO 1 element address
                uint32_t GetIndex = ((hfdcan.Instance->RXF1S & FDCAN_RXF1S_F1GI) >> FDCAN_RXF1S_F1GI_Pos);
                uint32_t* RxAddress = (uint32_t*)(hfdcan.msgRam.RxFIFO1SA + (GetIndex * DC_FDCAN_RX_FIFO_ELEMENT_SIZE));
                _dc_hal_receive_isr(RxAddress);
                // acknowledge the Rx FIFO 1 that the oldest element is read so that it increments the GetIndex
                hfdcan.Instance->RXF1A = GetIndex;
            }
        }

        if ((RxFifo1ITs & FDCAN_IR_RF1F) != 0) {
            dc_hal_stats.isr_rf1f_count++; // RF1F, Rx Fifo 1 Full
        }
        if ((RxFifo1ITs & FDCAN_IR_RF1L) != 0) {
            dc_hal_stats.isr_rf1l_count++; // RF1L, Rx Fifo 1 Message Lost
        }
    }

