olliw42/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-g4.c
    // EOL: Error Logging Overflow                -> Bit and Line Error
    // WDI: Watchdog Interrupt                    -> Protocol Error
    // PEA: Protocol Error in Arbitration Phase   -> Protocol Error
    // PED: Protocol Error in Data Phase          -> Protocol Error
    // ARA: Access to Reserved Address            -> Protocol Error
    uint32_t Errors = hfdcan.Instance->IR & (FDCAN_IR_ELO | FDCAN_IR_WDI | FDCAN_IR_PEA | FDCAN_IR_PED | FDCAN_IR_ARA);
    Errors &= hfdcan.Instance->IE;
    // EP: Error Passive                          -> Bit and Line Error
    // EW: Warning Status                         -> Protocol Error
    // BO: Bus_Off Status                         -> Protocol Error
    uint32_t ErrorStatusITs = hfdcan.Instance->IR & (FDCAN_IR_EP | FDCAN_IR_EW | FDCAN_IR_BO);
    ErrorStatusITs &= hfdcan.Instance->IE;

    if (Errors != 0) {
        __HAL_FDCAN_CLEAR_FLAG(&hfdcan, Errors); // clear the Error flags
        dc_hal_stats.isr_errors_count++;
    }
    if (ErrorStatusITs != 0) {
        __HAL_FDCAN_CLEAR_FLAG(&hfdcan, ErrorStatusITs); // clear the Error flags
        dc_hal_stats.isr_errorstatus_count++;
    }
}


// is already C context, not C++ !

#ifdef FDCAN2
void FDCAN2_IT0_IRQHandler(void)
{
    if (hfdcan.Instance == FDCAN2) _dc_hal_isr_handler();
}
#endif

void FDCAN1_IT0_IRQHandler(void)
{
    if (hfdcan.Instance == FDCAN1) _dc_hal_isr_handler();
}


//-- API

int16_t dc_hal_enable_isr(void)
{
HAL_StatusTypeDef hres;

    dronecan_rxwritepos = 0;
    dronecan_rxreadpos = 0;
    memset(&dc_hal_stats, 0, sizeof(dc_hal_stats));
    fd_frame_detected = 0;

// doc in stm32g4xx_hal_fdcan.c says: By default, all interrupts are assigned to line 0
// so we should not have to do this
//    hres = HAL_FDCAN_ConfigInterruptLines(
//        &hfdcan,
//        FDCAN_IT_GROUP_RX_FIFO0 | FDCAN_IT_GROUP_RX_FIFO1,
//        FDCAN_INTERRUPT_LINE0);
//    if (hres != HAL_OK) { return -DC_HAL_ERROR_ISR_CONFIG; }

    hres = HAL_FDCAN_ActivateNotification(
        &hfdcan,
//        FDCAN_IT_RX_FIFO0_NEW_MESSAGE | FDCAN_IT_RX_FIFO1_NEW_MESSAGE | FDCAN_IT_BUS_OFF,
        FDCAN_IT_RX_FIFO0_NEW_MESSAGE | FDCAN_IT_RX_FIFO0_FULL |
        FDCAN_IT_RX_FIFO1_NEW_MESSAGE | FDCAN_IT_RX_FIFO1_FULL |
        FDCAN_IT_BUS_OFF,
//        FDCAN_IT_ARB_PROTOCOL_ERROR | FDCAN_IT_DATA_PROTOCOL_ERROR,
//        FDCAN_IT_LIST_RX_FIFO0 | FDCAN_IT_LIST_RX_FIFO1 |
//        FDCAN_IT_LIST_BIT_LINE_ERROR | FDCAN_IT_LIST_PROTOCOL_ERROR,
        0);
    if (hres != HAL_OK) { return -DC_HAL_ERROR_ISR_CONFIG; }

    hfdcan.Instance->IR = 0xFFFFFFFF; // clear all flags by writing 1 to them

#ifdef FDCAN2
    if (hfdcan.Instance == FDCAN2) {
        NVIC_SetPriority(FDCAN2_IT0_IRQn, DRONECAN_IRQ_PRIORITY);
        NVIC_EnableIRQ(FDCAN2_IT0_IRQn);
    } else
#endif
    if (hfdcan.Instance == FDCAN1) {
        NVIC_SetPriority(FDCAN1_IT0_IRQn, DRONECAN_IRQ_PRIORITY);
        NVIC_EnableIRQ(FDCAN1_IT0_IRQn);
    }

    return 0;
}


int16_t dc_hal_receive(CanardCANFrame* const frame)
{
    if (frame == NULL) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

    _process_error_status();

    if (dronecan_rxwritepos == dronecan_rxreadpos) {
        return 0; // fifo empty
    }

    uint16_t rxreadpos = (dronecan_rxreadpos + 1) & DRONECAN_RXFRAMEBUFSIZEMASK;
    dronecan_rxreadpos = rxreadpos;

    frame->id = (dronecan_rxbuf[rxreadpos].r0 & CANARD_CAN_EXT_ID_MASK);
    frame->id |= CANARD_CAN_FRAME_EFF;

    // convert DLC to actual byte count
    uint32_t dlc = (dronecan_rxbuf[rxreadpos].r1 & DC_RX_FIFO_R1_DLC_MASK) >> 16;
    frame->data_len = _data_len_from_dlc(dlc);
    if (frame->data_len > CANARD_CANFD_FRAME_MAX_DATA_LEN) frame->data_len = CANARD_CANFD_FRAME_MAX_DATA_LEN; // should not happen, but play it safe

    // copy data bytes, and zero-fill
    for (uint8_t n = 0; n < CANARD_CANFD_FRAME_MAX_DATA_LEN; n++) {
        frame->data[n] = (n < frame->data_len) ? dronecan_rxbuf[rxreadpos].data[n] : 0;
    }

    frame->iface_id = 0;

    frame->canfd = ((dronecan_rxbuf[rxreadpos].r1 & DC_RX_FIFO_R1_FDF_BIT) != 0);

    dc_hal_stats.received_frame_count++;

    return 1;
}


void dc_hal_rx_flush(void)
{
    dronecan_rxwritepos = 0;
    dronecan_rxreadpos = 0;
    dc_hal_stats.rx_overflow_count = 0;
}


#endif // DRONECAN_USE_RX_ISR


//-------------------------------------------------------
// Filter
//-------------------------------------------------------

// num_filter_configs = 0 rejects all frames
int16_t dc_hal_config_acceptance_filters(
    const tDcHalAcceptanceFilterConfiguration* const filter_configs,
    const uint8_t num_filter_configs)
{
    if ((filter_configs == NULL) || (num_filter_configs > DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX)) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

    FDCAN_FilterTypeDef sFilterConfig = {};
    sFilterConfig.IdType = FDCAN_EXTENDED_ID;
    sFilterConfig.FilterType = FDCAN_FILTER_MASK; // classic filter: FilterID1 = id, FilterID2 = mask
    sFilterConfig.FilterConfig = FDCAN_FILTER_TO_RXFIFO0; // FDCAN_FILTER_DISABLE, FDCAN_FILTER_TO_RXFIFO1
    sFilterConfig.FilterIndex = 0;
    sFilterConfig.FilterID1 = 0;
    sFilterConfig.FilterID2 = 0;

    for (uint8_t n = 0; n < num_filter_configs; n++) {
        if (filter_configs[n].rx_fifo == DC_HAL_RX_FIFO0) {
            sFilterConfig.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
        } else
        if (filter_configs[n].rx_fifo == DC_HAL_RX_FIFO1) {
            sFilterConfig.FilterConfig = FDCAN_FILTER_TO_RXFIFO1;
        } else {
            sFilterConfig.FilterConfig = ((n & 0x01) == 0) ? FDCAN_FILTER_TO_RXFIFO0 : FDCAN_FILTER_TO_RXFIFO1;
        }
        sFilterConfig.FilterIndex = n;
        sFilterConfig.FilterID1 = (filter_configs[n].id & CANARD_CAN_EXT_ID_MASK);
        sFilterConfig.FilterID2 = (filter_configs[n].mask & CANARD_CAN_EXT_ID_MASK);
        HAL_StatusTypeDef hres = HAL_FDCAN_ConfigFilter(&hfdcan, &sFilterConfig);
        if (hres != HAL_OK) { return -DC_HAL_ERROR_CAN_CONFIG_FILTER; }
    }

    // fill remaining filters with default
    sFilterConfig.FilterID1 = 0;
    sFilterConfig.FilterID2 = 0;
    for (uint8_t n = num_filter_configs; n < DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX; n++) {
        //sFilterConfig.FilterConfig = ((n & 0x01) == 0) ? FDCAN_FILTER_TO_RXFIFO0 : FDCAN_FILTER_TO_RXFIFO1;
        //sFilterConfig.FilterConfig = (n == 0) ? FDCAN_FILTER_TO_RXFIFO0 : FDCAN_FILTER_DISABLE;
        sFilterConfig.FilterConfig = FDCAN_FILTER_DISABLE;
        sFilterConfig.FilterIndex = n;
        HAL_StatusTypeDef hres = HAL_FDCAN_ConfigFilter(&hfdcan, &sFilterConfig);
        if (hres != HAL_OK) { return -DC_HAL_ERROR_CAN_CONFIG_FILTER; }
    }

