olliw42/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-g4.c
    return 0;
}


//-------------------------------------------------------
// More Helper
//-------------------------------------------------------

tDcHalStatistics dc_hal_get_stats(void)
{
    _process_error_status(); // to ensure it is latest
    dc_hal_stats.error_sum_count =
        dc_hal_stats.bo_count + 
        dc_hal_stats.lec_count + dc_hal_stats.dlec_count +
        dc_hal_stats.pxe_count + dc_hal_stats.cel_count;
#ifdef DRONECAN_USE_RX_ISR
    dc_hal_stats.error_sum_count += dc_hal_stats.rx_overflow_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_xtd_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_rtr_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_fdf_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_brs_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_dlc_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_rf0l_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_rf0f_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_rf1l_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_rf1f_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_errors_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.isr_errorstatus_count;
#endif
    dc_hal_stats.error_sum_count += dc_hal_stats.tffl_count;
    dc_hal_stats.error_sum_count += dc_hal_stats.tfqf_count;
    return dc_hal_stats;
}


const char* dc_hal_psr_lec_to_str(uint32_t psr)
{
    uint32_t lec = (psr & FDCAN_PSR_LEC) >> FDCAN_PSR_LEC_Pos; // Last Error Code
    switch (lec) {
        case 0: return "ok";
        case 1: return "STUFF";
        case 2: return "FORM";
        case 3: return "ACK";
        case 4: return "BIT1";
        case 5: return "BIT0";
        case 6: return "CRC";
        case 7: return "NC"; // No Change
        default: return "??";
    }
}


const char* dc_hal_psr_act_to_str(uint32_t psr)
{
    uint32_t act = (psr & FDCAN_PSR_ACT) >> FDCAN_PSR_ACT_Pos; // Activity
    switch (act) {
        case 0: return "Sync";  // Synchronizing
        case 1: return "Idle";  // Idle
        case 2: return "Rx";    // Receiver
        case 3: return "Tx";    // Transmitter
        default: return "??";
    }
}


int16_t dc_hal_compute_timings(
    const uint32_t peripheral_clock_rate,
    const uint32_t target_bit_rate,
    tDcHalCanTimings* const timings)
{
    if (target_bit_rate != 1000000) {
        return -DC_HAL_ERROR_UNSUPPORTED_BIT_RATE;
    }

    // general rule:
    // tq = peripheral_clock_rate / bit_rate / prescaler
    // BS1 = SP * tq - 1, where SP is e.g. 3/4 = 75% or 7/8 = 87.5%
    // BS2 = tq - 1 - BS1 = (1 - SP) * tq
    // -> SP = (1 + BS1)/(1 + BS1 + BS2)

    // Note: ChatGPT was very clear on that one should use 80 MHz clock for FDCAN
    // we used 170 MHz before for classic CAN, but 80 MHz is said to be just better

    // timings by ArduPilot (confirmed by ChatGPT, by JLP, by myself using AP's code explicitly)
    // 10 tq
    // prescaler 8
    // BS1 = 8
    // BS2 = 1
    // SJW = 1
    // -> SP = 90.0%
    // Note: this is somewhat weird. AP cites a source that says that 8 tq would be optimal,
    // which can be achieved with prescaler 10, BS1 = 6, BS2 = 1, SJW = 1, -> SP = 7/8 = 87.5%.
    // It also would give SP 87.5% which ChatGPT says is industry standard. ??
#if 1
    if (peripheral_clock_rate == 80000000) { // 80 MHz
        timings->bit_rate_prescaler = 8;
        timings->bit_segment_1 = 8;
        timings->bit_segment_2 = 1;
        timings->sync_jump_width = 1;
    } else if (peripheral_clock_rate == 160000000) { // 160 MHz // NOT PREFFRED, but not terrible
        timings->bit_rate_prescaler = 16;
        timings->bit_segment_1 = 8;
        timings->bit_segment_2 = 1;
        timings->sync_jump_width = 1;
    } else if (peripheral_clock_rate == 170000000) { // 170 MHz // NOT PREFFRED
        timings->bit_rate_prescaler = 17;
        timings->bit_segment_1 = 8;
        timings->bit_segment_2 = 1;
        timings->sync_jump_width = 1;
    } else {
        return -DC_HAL_ERROR_UNSUPPORTED_CLOCK_FREQUENCY;
    }
#endif

    // timings generated by phryniszak for 75%
    // legacy: this is what we used before with 170 MHz FDCAN clock
#if 0
    if (peripheral_clock_rate == 170000000) { // 170 MHz
        timings->bit_rate_prescaler = 1;
        timings->bit_segment_1 = 127;
        timings->bit_segment_2 = 42; // -> SP = 0.75294 %
        timings->sync_jump_width = 42;
    } else if (peripheral_clock_rate == 160000000) { // 160 MHz
        timings->bit_rate_prescaler = 1;
        timings->bit_segment_1 = 119;
        timings->bit_segment_2 = 40; // -> SP = 0.75 %
        timings->sync_jump_width = 40;
    } else if (peripheral_clock_rate == 80000000) { // 80 MHz
        timings->bit_rate_prescaler = 1;
        timings->bit_segment_1 = 59;
        timings->bit_segment_2 = 20; // -> SP = 0.75 %
        timings->sync_jump_width = 20;
    } else {
        return -DC_HAL_ERROR_UNSUPPORTED_CLOCK_FREQUENCY;
    }
#endif
    // timings generated by phryniszak for 87.5%
#if 0
    if (peripheral_clock_rate == 170000000) { // 170 MHz
        timings->bit_rate_prescaler = 1;
        timings->bit_segment_1 = 147;
        timings->bit_segment_2 = 22;
        timings->sync_jump_width = 21;
    } else {
        return -DC_HAL_ERROR_UNSUPPORTED_CLOCK_FREQUENCY;
    }
#endif

    // let's do a check
    // datasheet:
    //   tq = prescaler * 1/f_clk
    //   bit_time = (1 + BS1 + BS2) * tq
    // =>
    //   bit_time = (1 + BS1 + BS2) * prescaler * 1/f_clk
    // we want bit_time = 1/1000000
    // =>
    //   (1 + BS1 + BS2) * prescaler = f_clk / 1000000
    const uint32_t bit_time = (1 + timings->bit_segment_1 + timings->bit_segment_2) * timings->bit_rate_prescaler;
    const uint32_t f_clk_MHz = peripheral_clock_rate / 1000000;
    if (bit_time != f_clk_MHz) {
        return -DC_HAL_ERROR_TIMING;
    }

    return 0;
}


int16_t dc_hal_compute_data_timings(
    const uint32_t peripheral_clock_rate,
    const uint32_t target_data_bit_rate,
    tDcHalCanDataTimings* const data_timings)
{
    // only 80 MHz FDCAN clock is supported (160 MHz SYSCLK / 80 MHz PLLQ)
    if (peripheral_clock_rate != 80000000) {
        return -DC_HAL_ERROR_UNSUPPORTED_CLOCK_FREQUENCY;
    }

    // ArduPilot table for 80 MHz, ardupilot/libraries/AP_HAL_ChibiOS/CANFDIface.cpp
    if (target_data_bit_rate == 1000000) {
        data_timings->bit_rate_prescaler = 4;
        data_timings->bit_segment_1 = 14;
        data_timings->bit_segment_2 = 5;
        data_timings->sync_jump_width = 5;
    } else if (target_data_bit_rate == 2000000) {
        data_timings->bit_rate_prescaler = 2;
        data_timings->bit_segment_1 = 14;
        data_timings->bit_segment_2 = 5;
        data_timings->sync_jump_width = 5;
    } else if (target_data_bit_rate == 4000000) {
        data_timings->bit_rate_prescaler = 1;
        data_timings->bit_segment_1 = 14;
        data_timings->bit_segment_2 = 5;
        data_timings->sync_jump_width = 5;
    } else if (target_data_bit_rate == 5000000) {
        data_timings->bit_rate_prescaler = 1;
        data_timings->bit_segment_1 = 11;
        data_timings->bit_segment_2 = 4;
        data_timings->sync_jump_width = 4;
    } else if (target_data_bit_rate == 8000000) {
        data_timings->bit_rate_prescaler = 1;
        data_timings->bit_segment_1 = 6;
        data_timings->bit_segment_2 = 3;
        data_timings->sync_jump_width = 3;
    } else {
        return -DC_HAL_ERROR_UNSUPPORTED_BIT_RATE;
    }

